import { Music } from '@/networks/music';
import { Singer } from '@/networks/singer';
import { getAssetsFileUrl } from '@/utils/fileUtil';
import { defineStore } from 'pinia';

// 1.定义并导出容器
/**
 * 参数一：容器 id，必须为唯一值，将来 pinia 会把所有的容器挂载到跟容器上
 * 参数二：选项对象
 */

export const useMusicStore = defineStore('music', {
	/**
	 * 类似组件的 data
	 */
	state: () => {
		return {
			musicList: [
				{
					musicId: '1',
					musicTitle: '漫长的告白',
					singers: [
						{
							singerId: '1',
							singerName: '双笙'
						}
					],
					musicUrl: getAssetsFileUrl(
						'audios',
						'漫长的告白-双笙-162283619.flac'
					),
					musicPic: getAssetsFileUrl('images', '奉君书-481895137.jpg'),
					duration: 288.301361,
					lyric: `[00:00.00]漫长的告白 (《暗恋橘生淮南》电视剧片头曲) - 双笙
					[00:06.86]词Lyricist：段思思
					[00:08.42]曲Composer：谭旋
					[00:09.67]编曲Arranger：韦国赟
					[00:11.54]制作人Producer：谭旋
					[00:13.41]吉他Guitarist：陈卉
					[00:14.97]弦乐Strings：国际首席爱乐乐团
					[00:18.40]和声Background Vocalist：双笙
					[00:20.28]录音工程师Recording Engineer：谭旋
					[00:23.08]混音工程师Mixing Engineer：Keizo
					[00:25.58]制作发行Produce Company：上海希瓜音乐制作有限公司
					[00:31.25]这个世界有多甜
					[00:35.17]眷顾平凡的少年
					[00:39.18]借你的笑眼 地球转一圈
					[00:43.03]好吧一辈子晕眩
					[00:47.18]别偷听我的心愿
					[00:51.07]我想它已经灵验
					[00:54.96]等无边的黑夜 输给地平线
					[00:59.04]见证孤单的终点
					[01:03.15]我们还有好多好多年
					[01:07.07]将未完的预言都实现
					[01:11.09]锁在日记手写的思念
					[01:15.06]你发足狂奔 赶来拥抱我的长街
					[01:23.06]我不管他们说多少至理名言
					[01:26.88]我除了你没有第二志愿
					[01:30.96]就用这青春的手验算永远的远
					[01:38.92]我明白总有些遗憾无法幸免
					[01:42.79]只求这场告白不算荒年
					[01:46.95]感谢 你说你很乐意去揭开一切悬念
					[01:55.24]滴答滴答 我们的遇见
					[02:03.21]滴答滴答 我们就永远
					[02:43.28]我们还有好多好多年
					[02:47.02]也许每一步都是瓦解
					[02:51.18]如果时间问你怎么选
					[02:55.02]麻烦你的心 可以偏向我的这边
					[03:02.71]我不管他们说多少至理名言
					[03:06.96]我除了你没有第二志愿
					[03:11.08]就用这青春的手验算永远的远
					[03:19.14]我明白总有些遗憾无法幸免
					[03:22.92]只求这场告白不算荒年
					[03:27.07]感谢 你说你很乐意去揭开一切悬念
					[03:39.10]我不管他们说什么天高路远
					[03:42.92]我除了你没有第二志愿
					[03:47.02]就让鸽子去蓝天 悲伤送给诗篇
					[03:55.00]我明白总有些遗憾只能亏欠
					[03:59.06]但求这本旅途终章喜悦
					[04:02.87]感谢 你说你很乐意去陪我抵达明天
					[04:13.13]滴答滴答 你视而不见
					[04:21.31]滴答滴答 你百看不厌`
				},
				{
					musicId: '2',
					musicTitle: '来世愿',
					singers: [
						{
							singerId: '2',
							singerName: '双笙（陈元汐）'
						}
					],
					musicUrl: getAssetsFileUrl(
						'audios',
						'来世愿-双笙（陈元汐）-177506784.flac'
					),
					musicPic: getAssetsFileUrl('images', '鹃-28188263.jpg'),
					duration: 275,
					lyric: `[00:00.00]来世愿 - 双笙 (陈元汐) 
					[00:03.71]词：绿无 
					[00:04.15]曲：MeLo 
					[00:04.42]编曲：MeLo 
					[00:04.86]制作人：绿无 双笙（陈元汐） 
					[00:06.38]混音：绿萝组/黄律铭Min 
					[00:07.95]母带：严祥博 
					[00:08.72]水下拍摄：王翎彤 
					[00:09.80]造型：阿左 
					[00:10.41]纪实拍摄：阿左 
					[00:11.29]企划统筹：刘乃铭@流水纪 
					[00:12.95]企划执行：一澜 
					[00:13.88]视频制作：飞米映画 
					[00:15.09]视频监制 ：高桥和希 
					[00:16.42]出品：双笙工作室×一立特工作室 
					[00:23.59]我有半只伞 [00:26.28]转过半段山 
					[00:31.22]擎不住落雪人间 [00:38.30]谷底堆满霜 
					[00:41.04]黑被月白色掩藏 
					[00:46.39]于我眼中褪色 
					[00:49.81]家乡 
					[00:54.68]睡在微微凉 醒在皎洁月 
					[01:02.44]折枝嶙峋路 炊烟迷了眼 
					[01:10.26]岁月的回应 烧去了温柔 
					[01:17.51]灰烬里留下一个我 
					[01:24.92]来世愿做天上水 江上雾 
					[01:32.75]行过山与川 不落地不生根 
					[01:40.11]此去一路跌宕 不尝人间百味 
					[01:48.26]遇见春 入眼皆是纯真 
					[02:24.40]睡在微微凉 醒在皎洁月 
					[02:32.16]折枝嶙峋路 炊烟迷了眼 
					[02:39.94]岁月的回应 烧去了温柔 
					[02:47.32]灰烬里留下一个我 
					[02:54.71]来世愿做天上水 江上雾 
					[03:02.56]行过山与川 不落地不生根 
					[03:09.81]此去一路跌宕 不尝人间百味 
					[03:18.09]遇见春 入眼皆是纯真 
					[03:25.95]来世愿做天上水 江上雾 
					[03:35.05]行过山与川 不落地不生根 
					[03:42.36]此去一路跌宕 不尝人间百味 
					[03:50.73]遇见春 入眼皆是纯真`
				},
				{
					musicId: '3',
					musicTitle: '千年之恋',
					singers: [
						{
							singerId: '1',
							singerName: '双笙'
						}
					],
					musicUrl: getAssetsFileUrl('audios', '千年之恋-双笙-147114890.flac'),
					musicPic: getAssetsFileUrl('images', '快平生-568581866.jpg'),
					duration: 268,
					lyric: `[00:00.00]千年之恋 (电视剧《琉璃》插曲) - 双笙
					[00:02.57]词Lyricist：段思思
					[00:03.38]曲Composer：谭旋
					[00:04.02]编曲Arranger：Terence Teo
					[00:04.83]制作人Producer：谭旋
					[00:05.79]吉他Guitarist：赵勤
					[00:06.60]弦乐Strings：国际首席爱乐乐团
					[00:08.37]和声Background Vocalist：邱芷玲
					[00:09.49]录音工程师Recording Engineer：赵彦雄
					[00:11.10]混音工程师Mixing Engineer：冯剑平
					[00:12.71]混音/母带工作室Mixing Studio：Horus Studios荷鲁斯
					[00:15.13]制作发行Produce Company：上海希瓜音乐制作有限公司
					[00:18.10]你看我的那一眼 一眼就千年
					[00:25.40]苦海无边 原来是指想念
					[00:33.08]一点疼痛 一点试炼 又白忙一圈
					[00:40.17]别小看我 我有的是时间
					[00:47.19]你是眼底的河流 长成发肤的皱
					[00:54.43]你是心头的山丘 岁月不能搬走
					[01:01.85]你是唇齿的微风 吹开云海的愁
					[01:08.06]动我魂魄 修炼我温柔 化作不朽
					[01:20.30]我可以沦落 可以承受
					[01:24.10]千年的寂寞
					[01:27.49]你给过的梦 已经足够
					[01:31.31]我幸福很久
					[01:34.93]心涧的暗涌 四海奔流
					[01:38.64]不住向思念伸手
					[01:42.07]人会了愚勇 怎么可能回头
					[02:05.70]你是眼底的河流 长成发肤的皱
					[02:12.90]你是心头的山丘 岁月不能搬走
					[02:20.19]你是唇齿的微风 吹开云海的愁
					[02:26.99]动我魂魄 修炼我温柔 化作不朽
					[02:38.35]我可以沦落 可以承受
					[02:42.19]千年的寂寞
					[02:45.64]你给过的梦 已经足够
					[02:49.41]我幸福很久
					[02:52.89]那些沉睡的 情根深种
					[02:56.76]落成眼角的朱红
					[03:00.28]若此生不懂 来世再叫醒我
					[03:07.28]看尽世间明灭 尝尽风雪
					[03:11.37]与月缺共勉
					[03:14.64]哪怕是一厢情愿
					[03:17.64]哪怕独自 等待千年
					[03:29.46]望皓月非月 年复一年
					[03:33.72]镜花照无眠
					[03:37.14]每一息热烈 都是伏线
					[03:40.95]刻情字深浅
					[03:44.43]望也曾情劫 悲悯苍天
					[03:48.13]宽恕我们的顽劣
					[03:51.81]送缘去直觉 送离人去婵娟
					[04:00.74]那一眼相见 注定相欠`
				},
				{
					musicId: '4',
					musicTitle: '小满',
					singers: [
						{
							singerId: '2',
							singerName: '双笙（陈元汐）'
						}
					],
					musicUrl: getAssetsFileUrl(
						'audios',
						'小满-双笙（陈元汐）-177506565.flac'
					),
					musicPic: getAssetsFileUrl('images', '咏心-81394.jpg'),
					duration: 241,
					lyric: `[00:00.00]双笙(陈元汐) - 小满
					[00:00.11]作词：绿无
					[00:00.22]作曲：MeLo
					[00:00.32]编曲：MeLo
					[00:00.42]吉他：吴余涛
					[00:00.57]长笛：乐琛桑
					[00:00.77]实录统筹：司鼓君
					[00:00.98]混音：严祥博
					[00:01.13]音乐制作人：绿无、双笙（陈元汐）
					[00:01.54]企划统筹：刘乃铭@流水纪
					[00:01.89]企划执行：一澜
					[00:02.10]视频制作：飞米映画
					[00:02.35]视频监制：高桥和希
					[00:02.59]出品：双笙工作室×一立特工作室
					[00:27.42]白墙青瓦 擦上晨光
					[00:33.47]雀儿又衔来橙花香
					[00:39.53]你扒着窗
					[00:44.11]脚下垫着老树桩
					[00:51.82]蜻蜓点水 季雨落生
					[00:57.87]你追着我过田埂
					[01:04.03]追过了豆蔻华年
					[01:08.50]山未长 水不远
					[01:15.78]说好要慢慢走
					[01:18.73]夏与冬雪之后
					[01:21.78]既作故旧也作新友
					[01:27.84]说好要等一等
					[01:30.92]待到古稀之后
					[01:33.98]在河畔桥头再牵牵手
					[02:05.15]院里树梢 长出月亮
					[02:11.09]漏了一地细碎星光
					[02:17.15]你推秋千
					[02:21.78]我晃晃酒窝浅浅
					[02:29.47]桂馥兰馨 赤绳良缘
					[02:35.53]誓言烙在字里行间
					[02:41.69]两支红烛 囍字盖头
					[02:46.67]配上了女儿酒
					[02:53.42]说好要慢慢走
					[02:56.32]夏与冬雪之后
					[02:59.42]既作故旧也作新友
					[03:05.48]说好要等一等
					[03:08.52]待到古稀之后
					[03:11.58]在河畔桥头再牵牵手
					[03:17.68]说好要等一等
					[03:20.74]待到古稀之后
					[03:23.79]你是桥畔的风景丽秀
					[03:33.61]暮景斜阳 北雁飞双
					[03:39.56]哪一天膝下满堂
					[03:45.75]再去记忆里拾荒
					[03:51.25]挑挑拣拣全都是你模样`
				}
			] as Music[],
			audio: ref(null) as unknown as HTMLAudioElement,
			music: {
				musicId: '',
				musicTitle: '',
				musicPic: '',
				singers: [] as Singer[]
			} as Music,
			play: false,
			currentTime: 0
		};
	},
	/**
	 * 类似组件的 computed，用来封装计算属性，具有缓存功能
	 */
	getters: {},
	/**
	 * 类似组件的 methods，封装业务逻辑，修改 state
	 */
	actions: {
		// setMusic(music: Music) {
		// 	this.music = music;
		// },
		// setPlay(flag: boolean) {
		// 	this.play = flag;
		// },
		// setCurrentTime(time: number) {
		// 	this.currentTime = time;
		// }
	}
});

// 2.使用容器中的state

// 3.修改state

// 4.使用 action
